[
    {
        "bookId": 1,
        "bookName": "The Silent Patient",
        "author": "Alex Michaelides",
        "image": "https://i.ibb.co/mqKPcBb/ar-190329317-removebg-preview.png",
        "review": "'The Silent Patient' by Alex Michaelides is a riveting psychological thriller that expertly weaves together elements of mystery, suspense, and psychological intrigue. The narrative unfolds with precision, drawing readers into the enigmatic world of Alicia Berenson, a celebrated artist who has seemingly inexplicably murdered her husband and then retreated into silence. Michaelides skillfully constructs a labyrinth of twists and turns, keeping readers guessing until the very end. The characters are complex and multi-dimensional, each harboring secrets and motivations that add layers of depth to the story. As the truth behind Alicia's silence gradually unravels, the tension mounts, leading to a shocking and satisfying conclusion that will leave readers stunned. Beyond its gripping plot, 'The Silent Patient' delves into themes of guilt, trauma, and the complexities of the human mind, prompting readers to question the nature of perception and reality. With its masterful storytelling and unexpected twists, this novel is a must-read for fans of psychological suspense, offering an unforgettable journey into the darkest corners of the psyche.",
        "totalPages": 336,
        "rating": 4.5,
        "category": "Fiction",
        "tags": [
            "Suspense",
            "Psychological"
        ],
        "publisher": "Celadon Books",
        "yearOfPublishing": 2019
    },
    {
        "bookId": 2,
        "bookName": "Educated",
        "author": "Tara Westover",
        "image": "https://i.ibb.co/tcp488K/00e8d0c73b9b4df790211ba56a74ca9e-removebg-preview.png",
        "review": "'Educated' by Tara Westover is a captivating memoir that chronicles the author's extraordinary journey from a childhood in rural Idaho, raised by fundamentalist parents skeptical of formal education, to eventually earning a PhD from Cambridge University. Westover's narrative is a testament to the power of resilience and self-discovery in the face of adversity. Through vivid prose and poignant reflection, she recounts the challenges of growing up in a family marked by isolation, abuse, and deeply ingrained beliefs that often clashed with the outside world. As Westover embarks on a quest for knowledge and independence, she confronts not only the limitations of her upbringing but also the complexities of identity and belonging. The memoir is a compelling exploration of the transformative power of education, as Westover grapples with the tensions between familial loyalty and personal growth. Her journey is as inspiring as it is harrowing, reminding readers of the importance of perseverance and the capacity for change. 'Educated' is a powerful testament to the resilience of the human spirit and a stirring reminder of the value of education in shaping our lives.",
        "totalPages": 352,
        "rating": 4.7,
        "category": "Biography",
        "tags": [
            "Memoir",
            "Education"
        ],
        "publisher": "Random House",
        "yearOfPublishing": 2018
    },
    {
        "bookId": 3,
        "bookName": "The Great Gatsby",
        "author": "F. Scott Fitzgerald",
        "image": "https://i.ibb.co/JxNxmJb/merlin-148012050-ac959e76-b4d3-4d6a-9a7e-7833897163ae-article-Large-removebg-preview.png",
        "review": "'The Great Gatsby' by F. Scott Fitzgerald is a timeless masterpiece that immerses readers in the dazzling world of 1920s America, offering a poignant exploration of the elusive American Dream and the disillusionment that often accompanies its pursuit. Set amidst the opulence of Long Island's elite, the novel follows the enigmatic Jay Gatsby, a mysterious millionaire who becomes entangled in a web of love, ambition, and tragedy. Through the eyes of Nick Carraway, the story's narrator, Fitzgerald paints a vivid portrait of a society consumed by materialism and excess, where wealth and social status reign supreme. Yet beneath the glittering facade lies a world rife with corruption, moral decay, and unfulfilled desires.",
        "totalPages": 180,
        "rating": 4.3,
        "category": "Fiction",
        "tags": [
            "Classics",
            "Romance"
        ],
        "publisher": "Charles Scribner's Sons",
        "yearOfPublishing": 1925
    },
    {
        "bookId": 4,
        "bookName": "The Subtle Art of Not Giving a F*ck",
        "author": "Mark Manson",
        "image": "https://i.ibb.co/TDG5MjL/bookcover-thesubtleart-removebg-preview.png",
        "review": "'The Subtle Art of Not Giving a F*ck' by Mark Manson offers a refreshing and unconventional approach to self-help literature, challenging readers to reassess their priorities and adopt a mindset focused on what truly matters. With a candid and irreverent tone, Manson presents a counterintuitive philosophy that emphasizes embracing life's inevitable struggles rather than seeking constant positivity or validation. Drawing on personal anecdotes, psychological insights, and philosophical wisdom, Manson encourages readers to confront uncomfortable truths and take responsibility for their own happiness.",
        "totalPages": 224,
        "rating": 4.2,
        "category": "Self-Help",
        "tags": [
            "Motivational",
            "Life Advice"
        ],
        "publisher": "HarperOne",
        "yearOfPublishing": 2016
    },
    {
        "bookId": 5,
        "bookName": "Harry Potter and the Philosopher's Stone",
        "author": "J.K. Rowling",
        "image": "https://i.ibb.co/xL7CqXD/rrb-124950-removebg-preview.png",
        "review": "'Harry Potter and the Philosopher's Stone' by J.K. Rowling is an enchanting introduction to the magical world of Hogwarts School of Witchcraft and Wizardry. Through the eyes of the young wizard Harry Potter, readers embark on a captivating adventure filled with spells, friendships, and the eternal battle between good and evil. Rowling's imaginative storytelling, vivid characters, and intricate plot twists captivate audiences of all ages, making this novel a timeless classic. With themes of bravery, friendship, and the power of love woven seamlessly throughout, 'Harry Potter and the Philosopher's Stone' is a magical journey that continues to inspire readers around the world.",
        "totalPages": 320,
        "rating": 4.9,
        "category": "Fantasy",
        "tags": [
            "Magic",
            "Adventure"
        ],
        "publisher": "Bloomsbury",
        "yearOfPublishing": 1997
    },
    {
        "bookId": 6,
        "bookName": "To Kill a Mockingbird",
        "author": "Harper Lee",
        "image": "https://i.ibb.co/9hwmDkN/9781435132412-us-removebg-preview.png",
        "review": "'To Kill a Mockingbird' by Harper Lee is a timeless masterpiece that confronts the complexities of racial injustice and moral growth in 1930s Alabama. Through the eyes of young Scout Finch, readers witness her father, Atticus Finch, defending a black man wrongly accused of raping a white woman. Lee's exquisite prose and poignant storytelling capture the essence of compassion, courage, and empathy in the face of prejudice and hatred. The novel's enduring relevance lies in its exploration of social injustice and the timeless lessons it imparts on the importance of standing up for what is right, making it an essential read for all generations.",
        "totalPages": 281,
        "rating": 4.6,
        "category": "Fiction",
        "tags": [
            "Classic",
            "Social Issues"
        ],
        "publisher": "J.B. Lippincott & Co.",
        "yearOfPublishing": 1960
    },
    {
        "bookId": 7,
        "bookName": "The Catcher in the Rye",
        "author": "J.D. Salinger",
        "image": "https://i.ibb.co/MBCKZ9g/CLASSICSBC24-frontcopie-1024x1024-removebg-preview.png",
        "review":"'The Catcher in the Rye' by J.D. Salinger is a timeless classic that delves into the mind of disillusioned teenager Holden Caulfield. Through Holden's cynical yet introspective narration, Salinger masterfully explores themes of alienation, innocence, and the loss of childhood. The novel's raw authenticity and poignant portrayal of adolescent angst continue to resonate with readers, transcending generations. Salinger's writing style, characterized by its colloquial language and distinctive voice, immerses readers in Holden's world, evoking empathy and reflection. 'The Catcher in the Rye' remains a seminal work of literature, offering profound insights into the human condition and the complexities of growing up.",
        "totalPages": 224,
        "rating": 4.4,
        "category": "Fiction",
        "tags": [
            "Coming of Age",
            "American Literature"
        ],
        "publisher": "Little, Brown and Company",
        "yearOfPublishing": 1951
    },
    {
        "bookId": 8,
        "bookName": "The Alchemist",
        "author": "Paulo Coelho",
        "image": "https://i.ibb.co/jDcC6tq/book-The-Alchemist-book-removebg-preview.png",
        "review": "'The Alchemist' by Paulo Coelho is a profound allegorical tale of self-discovery and spiritual enlightenment. Following the journey of Santiago, a shepherd boy, as he embarks on a quest to fulfill his personal legend, the novel explores themes of destiny, perseverance, and the interconnectedness of all things. Coelho's lyrical prose and philosophical insights inspire readers to pursue their dreams with unwavering determination, reminding us that the universe conspires to help those who follow their hearts. With its timeless wisdom and universal appeal, 'The Alchemist' continues to captivate audiences worldwide, encouraging them to embrace the transformative power of belief and pursue their own paths to fulfillment.",
        "totalPages": 197,
        "rating": 4.7,
        "category": "Fiction",
        "tags": [
            "Philosophical",
            "Adventure"
        ],
        "publisher": "HarperCollins",
        "yearOfPublishing": 1988
    },
    {
        "bookId": 9,
        "bookName": "Feluda Omnibus",
        "author": "Satyajit Ray",
        "image": "https://i.ibb.co/NNx1dT6/Feluda-2-removebg-preview.png",
        "review": "'Feluda Omnibus' is a collection of detective novels by Satyajit Ray, featuring the brilliant detective Feluda. These stories bring together the adventures of Feluda, a masterful investigator, and his companions as they solve various intriguing cases. Through Feluda's keen intellect and sharp observations, readers are taken on thrilling journeys through the streets of Kolkata and beyond. The stories in 'Feluda Omnibus' not only entertain but also provide insights into societal issues and human nature. With its engaging plots, memorable characters, and clever twists, this collection is a must-read for fans of detective fiction.",
        "totalPages": 500,
        "rating": 4.6,
        "category": "Detective",
        "tags": [
            "Feluda",
            "Detective",
            "Bengali Novel"
        ],
        "publisher": "Ananda Publishers",
        "yearOfPublishing": 1975
    },
    {
        "bookId": 10,
        "bookName": "Tuntuni'r Boi",
        "author": "Upendrakishore Ray Chowdhury",
        "image": "https://i.ibb.co/P6g7tjB/51-Js-Nqh-ZWBL-SR600-315-PIWhite-Strip-Bottom-Left-0-35-PIStar-Rating-FIVE-Bottom-Left-360-6-SR600-3.png",
        "review": "'Tuntuni'r Boi' is a delightful collection of children's stories written by Upendrakishore Ray Chowdhury, a pioneer of Bengali children's literature. The book features the adventures of Tuntuni, a curious and mischievous little bird, as he explores the world around him. Through Tuntuni's escapades, young readers learn valuable lessons about friendship, courage, and kindness. Upendrakishore's engaging storytelling and vivid illustrations make 'Tuntuni'r Boi' a beloved classic that continues to captivate generations of Bengali children.",
        "totalPages": 120,
        "rating": 4.5,
        "category": "Children Literature",
        "tags": [
            "Tuntuni",
            "Children's Stories",
            "Adventure"
        ],
        "publisher": "Ananda Publishers",
        "yearOfPublishing": 1915
    }
]